{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "boletines",
    "1": "declaracion_concejo_municipal",
    "2": "decreto",
    "3": "decreto_ordenanza",
    "4": "decretos_concejo_municipal",
    "5": "ordenanza",
    "6": "otro",
    "7": "resolucion",
    "8": "resolucion_concejo_municipal"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "boletines": 0,
    "declaracion_concejo_municipal": 1,
    "decreto": 2,
    "decreto_ordenanza": 3,
    "decretos_concejo_municipal": 4,
    "ordenanza": 5,
    "otro": 6,
    "resolucion": 7,
    "resolucion_concejo_municipal": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 31002
}
